# BooleanUnionFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..BooleanUnionFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failed to merge overlapping solids
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BooleanUnionFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BooleanUnionFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BooleanUnionFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace